import random

from telethon import events

from Emilia import telethn, ORIGINAL_EVENT_LOOP

GDNIGHT = [
    "`മരിക്കേണ്ട വ്യക്തിക്ക് ഒരു വഴിയേയുള്ളൂ, എന്നാൽ ജീവിതത്തിൽ വരാൻ ആഗ്രഹിക്കുന്ന വ്യക്തിക്ക് നിരവധി വഴികളുണ്ട്. മധുര സ്വപ്നങ്ങൾ കാണുക. നന്നായി ഉറങ്ങുക. ശുഭരാത്രി`",
    "`എല്ലാ ദിവസവും അനുഭവത്തോടെ അവസാനിക്കുന്നു. നിങ്ങൾക്ക് ഇന്ന് ധാരാളം അനുഭവങ്ങൾ ഉണ്ടായി എന്ന് പ്രതീക്ഷിക്കുന്നു. ജോലി കഴിഞ്ഞ് ഉറങ്ങാൻ പോകുന്ന സമയം. ദിവസം അവസാനിച്ചു, മറ്റൊരു ദിവസം ഇനിയും ഉണ്ട്. സുഹൃത്തേ,ശുഭരാത്രി`",
    "`സൂര്യൻ പോകുമ്പോൾ ലോകത്തെ പ്രകാശിപ്പിക്കുന്നതിന് ചന്ദ്രൻ അതിന്റെ സൗന്ദര്യത്തിലും തണുപ്പിലും മങ്ങുന്നു. ദിവസം കഴിയുമ്പോൾ നിങ്ങളുടെ ഉറക്കം നിങ്ങളെപ്പോലെ മൃദുലമാകുമെന്ന പ്രതീക്ഷയോടെ നിങ്ങൾക്ക് അൽപ്പം വിശ്രമം നൽകുക. !`",
    "`നിങ്ങളുടെ സ്വപ്നത്തിന്റെ ഇരുണ്ട രാത്രികൾ പിറ്റേന്ന് രാവിലെ കണ്ണാടി നോക്കുന്നതുവരെ നിങ്ങളുടെ മുഖം തിളങ്ങാൻ കാത്തിരിക്കുന്നു. ശുഭരാത്രി!`",
    "`രാത്രിയിൽ ഒരു രാജാവിനെപ്പോലെ ഉറങ്ങുക, പകൽ മുതലാളിയെപ്പോലെ പ്രവർത്തിക്കുക. ഗോവണിക്ക് മുകളിൽ എത്തുന്നതിൽ നിന്ന് നിങ്ങളെ തടയാൻ യാതൊന്നിനും കഴിയില്ല. ശുഭ രാത്രി!`",
    "`ഇതുപോലുള്ള രാത്രികൾ ദൈവത്തിൽ നിന്നുള്ള അനുഗ്രഹങ്ങളാണ്. ഉണർന്നിരിക്കുന്നതിലൂടെ ഈ അനുഗ്രഹം പാഴാക്കരുത്. താങ്കൾക്ക് ശുഭരാത്രി ആശംസിക്കുന്നു. ഇന്ന് രാത്രി നല്ല ഉറക്കം!`",
    "`സമാധാനത്തോടെ ഉറങ്ങാനും പുഞ്ചിരിച്ചുകൊണ്ട് ഉണരാനും കഴിയട്ടെ. ശുഭരാത്രി!`",
    "`ഇന്നത്തെ ദിവസം ദൈവം തന്ന എല്ലാ അനുഗ്രഹങ്ങൾക്കും നന്ദി.. നാളെ എല്ലാം ശുഭം ആകട്ടെ എന്ന പ്രാർത്ഥനയോടെ. ശുഭരാത്രി!`",
    "`നല്ലൊരു നാളേക്കായി നമുക്കിന്നു വിട പറയാം. ഇന്ന് സുഖമായും നല്ല സ്വപ്നങ്ങളും കണ്ടു കൊണ്ട് ഇന്ന് കിടന്നുറങ്ങാം. ശുഭരാത്രി!`",
    "`നിശാഗന്ധി പൂത്തു തുടങ്ങി മാനത്തു നക്ഷത്രങ്ങൾ മിന്നി തിളങ്ങാൻ തുടങ്ങി മിന്നാമിനുങ്ങുകൾ കത്തി ജ്വലിക്കാൻ തുടങ്ങി ഉറങ്ങാനുള്ള സമയമായി. ശുഭരാത്രി!`",
    "`നല്ല സ്വപ്നങ്ങളുമായി നാളെ പ്രഭാതം വരെ ശുഭരാത്രി നേരുന്നു!`",
    "`ലോകം മുഴുവൻ ഭീതിയിലായിരിക്കുമ്പോൾ പ്രാർത്ഥിക്കാം നമുക്ക് നല്ലൊരു നാളെക്കായി. ശുഭ രാത്രി!`",
    "`സങ്കടപെടുന്ന ഹൃദയങ്ങളെ സ്നേഹിക്കണം. എന്നാൽ സ്നേഹിക്കുന്ന ഹൃദയത്തെ സങ്കടപെടുത്തരുത്. ശുഭ രാത്രി.`",
    "`നമ്മുടെ നാടിനു വേണ്ടി പ്രാർത്ഥിച്ചു കൊണ്ട് നമുക്ക് ഉറങ്ങാം. പുതിയ പുലരിയിൽ ശുഭ വാർത്തകൾ കേൾക്കാൻ കഴിയട്ടെ. ശുഭ രാത്രി.`",
    "`തിരിച്ചു കിട്ടാത്ത ഒരു ദിവസം കൂടി ഓർമയുടെ പാടി ഇറങ്ങി പോകുമ്പോൾ ഇന്നത്തെ നല്ല ഓർമ്മകൾ നാളെയും പുനർജനിക്കട്ടെ...  ശുഭ രാത്രി.`",
    "`എന്ന് നീ തിരിച്ചറിവുള്ളവൻ ആയി തീരുന്നുവോ അന്ന് മുതൽ നിനക്ക് ദുഃഖങ്ങൾ ഇല്ലാതാവുന്നു ...... ശുഭരാത്രി...`",
    "`ഒരു  രാത്രി  കൊണ്ട്  സ്വപ്‌നങ്ങൾ  തീരുന്നില്ല . ഒരു  സ്വപ്നം   കൊണ്ട്  ജീവിതവും , അത്  കൊണ്ട്  കാത്തിരിക്കാം  നല്ല  ഒരു  നാളേക്ക്  വേണ്ടി . ഗുഡ്നൈറ്റ്.`",
    "`ഏറ്റവും നല്ല ആയുധം     ക്ഷമയാണ്.!ഏറ്റവും വലിയ പ്രതികാരം   മൗനമാണ്.   ശുഭ രാത്രി.!`",
    "`സ്വപ്‌നങ്ങൾ ജീവിതത്തിലെ സുന്ദരമായ ഭാഗമാണ് അതിനെ നഷ്ട്ടപ്പെടുത്താതിരിക്കുക വേഗം കിടന്നുറങ്ങിക്കോ ആ സുന്ദര നിമിഷങ്ങൾ നമ്മെ കാത്തിരിക്കുന്നു...ശുഭരാത്രി..`",
    "`വേഷം കൊണ്ട് ആരേയും അളക്കരുത് തെരുവിൽ കിടക്കുന്ന കടലാസ് കഷ്ണമാണെങ്കിലും ........ ഒരുനാൾ അത് പട്ടമായി ആകാശത്തുയർന്നാൽ...... തല ഉയർത്തിനോകേണ്ടി  വരും നിങ്ങളും ഞാനും.   ശുഭ രാത്രി!`",
    "`നമ്മളുറങ്ങുമ്പോൾ വരാൻ..എത്രയെത്ര സ്വപ്നങ്ങളായിരിക്കാം ഉണർന്നിരിക്കുന്നുണ്ടാവുക..  ശുഭ രാത്രി!`",
    "`സ്വപ്നങ്ങള്ക്ക് ജീവനില്ല പക്ഷേ പലരും ജീവിക്കുന്നത് സ്വപ്നങ്ങള്ക്ക് വേണ്ടി ആണെന്ന് മാത്രം      ശുഭ രാത്രി!`",
    "` ഇന്ന് നീ മറക്കാൻ ശ്രമിച്ചതെല്ലാംനാളെ നിനക്ക് ഓർക്കാൻ കഴിഞ്ഞേക്കാം. പക്ഷേ ഇന്ന് നിനക്ക് നഷ്ടമായതൊന്നും നാളെ തിരിച്ച് കിട്ടീ എന്ന് വരില്ല......ഗുഡ് നൈറ്റ്‌!`",
    "`സ്വപ്നങ്ങളുടെ അത്ഭുതലോകവുമായി ഇതാ ഒരു രാത്രി കൂടി വരവായി. മനോഹര സ്വപ്നങ്ങളും, ആ സ്വപ്‌നങ്ങൾ യാഥാർഥ്യമാക്കാനുള്ള ഊർജവുമായി നാളെ വീണ്ടും ഉണരാം. ഗുഡ് നൈറ്റ്!`",
    "`ജീവിതം ഒന്നേയുള്ളു. അത് തോൽവി സമ്മതിച്ചു ഉരുകി തീർക്കാനുള്ളതല്ല. പൊരുതി നേടാനുള്ളതാണ്. പൊരുതി നേടാനുള്ള കരുത്തുമായി നാളെ വീണ്ടു ഉണരാം.ശുഭ രാത്രി!`",
    "`മനസ്സിലുള്ള എല്ലാ സ്വപ്നങ്ങളും ആഗ്രഹങ്ങളും പ്രതീക്ഷകളും പൂവണിയുന്ന ഒരു നല്ല ദിവസമാവട്ടെ നാളെയെന്നു ആശംസിയ്ക്കുന്നു. ഗുഡ് നൈറ്റ്!`",
    "`നിങ്ങളുടെ വിജയത്തിലേയ്ക്കും പരാജയത്തിലേയ്ക്കും ഉള്ള ദൂരത്തിന്റെ പേര് ഒന്നാണ്…മനസ്സ്.. മനസ്സിനെ ജയിച്ചാൽ പിന്നെ ഒന്നിനും നിങ്ങളെ തോല്പിയ്ക്ക്യനാവില്ല!`",
    "`രാത്രികൾ പകലിന്റെ സ്വപ്നങ്ങളാണ്. ഒരു പാട് പ്രതീക്ഷകളുമായി ഉറങ്ങുന്ന സ്വപ്‌നങ്ങൾ. ഗുഡ് നൈറ്റ്!`",
    "`നിന്റെ നെഞ്ചിടിപ്പിന്റെ താളമാവാൻ,നിന്റെ നിശ്വാസമാവാൻ, നിന്റെ പ്രതീക്ഷകളാവാൻ, നിന്റെ സ്വപ്നങ്ങളാവാൻ, നിന്നിലെ നീയാവാൻ എന്നെ അനുവദിയ്ക്കയു. ശുഭ രാത്രി!`",
    "`സ്വപ്നങ്ങളാണ് വിജയത്തിലേയ്ക്കയുള്ള ആദ്യ ചവിട്ടു പാടി. സ്വപ്‌നങ്ങൾ കാണുക. അവ യാഥാർഥ്യമാക്കാൻ പ്രയത്നിയ്ക്കുക. പുതിയൊരു ലോകം നിങ്ങള്ക്ക് മുന്നിൽ വാതിൽ തുറക്കും. ഗുഡ് നൈറ്റ്!`",
    "`നന്ദി, എനിയ്ക്കു സ്വപ്‌നങ്ങൾ തന്നതിന്, ജീവിതത്തിനു നിറങ്ങൾ തന്നതിനു, പുഞ്ചിരിത്തന്നതിനു, അതിലെല്ലാം ഉപരി എനിയ്ക്കു നിന്നെത്തന്നെ തന്നത്തിനു. ഗുഡ് നൈറ്റ്!`",
    "`കൂരിരുട്ടുള്ള രാത്രികൾക്കു ശേഷമാണ് നിറമുള്ള പകലുകൾ ഉണ്ടാകുന്നതു. ഈ കൂരിരുട്ടിനെ ഭയക്കേണ്ടതില്ല, നിറമാർന്ന ഒരു പ്രഭാതം നിന്നെ കാത്തിരിപ്പുണ്ട്. പ്രയത്നിയ്ക്കയു. ഗുഡ് നൈറ്റ്!`",
    "`നമ്മുടെ സ്വപ്നൾക്കു കടിഞ്ഞാണിടുന്നത് നമ്മൾ തന്നെയാണ്. നിറമുള്ള സ്വപ്‌നങ്ങൾ കാണാൻ മനസ്സിനെ അനുവദിയ്ക്കാം. ആ സ്വപ്നങ്ങളെ സത്യമാക്കാൻ നമുക്കു പ്രയത്നിയ്ക്ക്യം. ഗുഡ് നൈറ്റ്!`",
    "`നിന്റെ പാട്ടായി, കവിതയായി, നിഴലായി, സൗഹൃദമായി, പ്രണയമായി ഞാനെന്നും കൂടെയുണ്ടാവും. എന്നും എന്നെന്നും. ഗുഡ് നൈറ്റ് മൈ ലവ്!`",
    "`ഒരിയ്ക്കലും വരില്ലെന്നറിഞ്ഞിട്ടും നിന്റെ കാലൊച്ചയ്ക്കയായി ഞാൻ കാതോർക്കുന്നു, നിന്റെ മൃദുസ്പർശത്തിനായി ഹൃദയം തേങ്ങുന്നു. നീ വരുന്നതും കാത്തു എന്നും ഞാൻ ഈ പുഴയോരത്തുണ്ടാവും. ഗുഡ് നൈറ്റ്!`",
]


@telethn.on(events.NewMessage(pattern="(?i)goodnight$"))
async def Emi_(m: events.NewMessage):
    if not ORIGINAL_EVENT_LOOP:
        return
    GDNIGHT = random.choice(GDNIGHT)
    await m.reply(GDNIGHT)


@telethn.on(events.NewMessage(pattern="(?i)good night$"))
async def Emi_(m: events.NewMessage):
    if not ORIGINAL_EVENT_LOOP:
        return
    GDNIGHT = random.choice(GDNIGHT)
    await m.reply(GDNIGHT)



@telethn.on(events.NewMessage(pattern="(?i)gdnight$"))
async def Emi_(m: events.NewMessage):
    if not ORIGINAL_EVENT_LOOP:
        return
    GDNIGHT = random.choice(GDNIGHT)
    await m.reply(GDNIGHT)

@telethn.on(events.NewMessage(pattern="(?i)good night$"))
async def Emi_(m: events.NewMessage):
    if not ORIGINAL_EVENT_LOOP:
        return
    GDNIGHT = random.choice(GDNIGHT)
    await m.reply(GDNIGHT)

@telethn.on(events.NewMessage(pattern="(?i)gdnight$"))
async def Emi_(m: events.NewMessage):
    if not ORIGINAL_EVENT_LOOP:
        return
    GDNIGHT = random.choice(GDNIGHT)
    await m.reply(GDNIGHT)

@telethn.on(events.NewMessage(pattern="(?i)GDnight$"))
async def Emi_(m: events.NewMessage):
    if not ORIGINAL_EVENT_LOOP:
        return
    GDNIGHT = random.choice(GDNIGHT)
    await m.reply(GDNIGHT)



@telethn.on(events.NewMessage(pattern="(?i)Gdnight$"))
async def Emi_(m: events.NewMessage):
    if not ORIGINAL_EVENT_LOOP:
        return
    GDNIGHT = random.choice(GDNIGHT)
    await m.reply(GDNIGHT)
